// *در فایل جی اس از زبان جاوااسکریپت استفاده میکنیم و در  ساخت و کنترل محتوای پویای صفحات وب کاربرد دارد و می تواند بدون نیاز به بارگیری مجدد صفحه به طور دستی هر چیزی را در صفحه جابه جا یا به روزرسانی کنیم یا به عبارت دیگر تغییر دهیم


// *توابع در جاوااسکریپت مثل عملگر هستند که می‌توانند یک یا چند مقدار ورودی را دریافت کرده و با انجام محاسبات خروجی متناسب با ورودی‌ها را تولید کند و ماهم در اینجا برای اعتبارسنجی اطلاعاتی کاربر واردمیکند از یک تابع استفاده میکنیم که شروط لازم را بررسی کند که یا اخطار دهد یا دکمه افزودن را فعال کند

function formValidation() {
   // با استفاده از آیدی که به اینپوت دادیم مقدار ورودی که کاربر واردمیکند را میگیریم که آن را بررسی کنیم
   let Phone = document.getElementById('inputPhone').value;
   let nameContact = document.getElementById('inputName').value;

   // در این شرط بررسی میکنیم که مقدار ورودی عدد باشد و همچنین طول آن 11رقم باشد و با اعداد 09 شروع شده باشد که اگر این شرط برقرار باشد وارد حلقه میشود و بررسی های دیگر انجام میشود و اگر شرط درست نباشد پیام خطا به کاربر نمایش داده میشود و دکمه غیرفعال میماند
   if (Number(Phone) && Phone.length == 11 && Phone.startsWith('09')) {
   // وقتی وارد حلقه میشود از اولین عدد شروع به بررسی میکند تا 11امین عدد
      for (let num = 0 ; num < 11  ; num++) {
      // در اینجا شرطمون بررسی میکند که هرکدام از 11رقم. اعداد بین 0 تا 9 باشد
         if (Phone[num] >= 0 && Phone[num] <= 9) {
          //اگر شرط برقرار باشد دکمه فعال میشود 
             document.getElementById('addContactButton').disabled = false;
            //  در اینجا مقدار disabled
            // بولین میباشد که در سندمان آن را غیرفعال مشخص کرده ایم و اگر اطلاعات واردشده درست باشد مقدار آن را با فالس مساوی میکنیم که حالت غیرفعال بودن پیش فرض ان از بیین برود و دکمه فعال شود
            
             document.getElementById('wrongNumber').innerHTML = "";
            // اگر کاربر اطلاعات اشتباه وارد کند و بعد ویرایش و درست کند پیام خطا باقی میماند برای همین مقدار داخل تگ اسپن را با استفاده از اینراچ تی ام ال خالی میکنیم 
         }
      }
   }else{
      //  اگر اولین شرط تابع برقرار نباشد پیام خطا را نشان میدهد و دکمه غیرفعال میماند
      document.getElementById('addContactButton').disabled = true;
      document.getElementById('wrongNumber').innerHTML = "لطفا شماره مخاطب را درست وارد کنید"
      // در اینجا با استفاده از آیدی به اسپنی که برای نشان دادن پیام خطا نوشتیم دسترسی پیدا میکنیم و با استفاده از اینراچ تی ام ال داخل آن یه محتوا میریزیم که همان پیام خطا است 
      // با استفاده از این ویژگی میتونیم محتوای موجود در یک عنصر رو دریافت، تغییر و یا از نو ایجاد نماییم
   }
   if (nameContact == "" || Phone == "") {
      // اگر فیلد ها خالی باشد دکمه همچنان غیرفعال میماند یعنی مقدار disabled را برابر با true میگذاریم
      document.getElementById('addContactButton').disabled = true;
   };
};

// *یک تابع فرضی درست کردم برای اینکه وقتی کاربر دکمه افزودن مخاطب را کلیک کرد اگر شماره واردشده جزو آرایه ی فرضی ما بود مثلا پیام لودشدن نشان دهد

// *من در اینجا سرچ کردن مخاطب را فقط بر اساس شماره آن درنظر گرفته ام 
 
// همان آرایه ی فرضی هستش 
   let allContact = [
      '09154889814' ,
      '09158197520'
   ]

// در این تابع بررسی میکنیم که ببینیم شماره ای که کاربر وارد کرده است جزو لیست فرضی ما هست یا نه
function addContact() {
   // مقدار ورودی اینپوت شماره موبایل را در یک متغییر ریختم 
   let contact = document.getElementById('inputPhone').value;
   // اینجا از یکی از فیچر های جاوااسکریپت استفاده کردم در آرایه مقدار گرفته شده را پیدا میکند و تایپ این فیچر بولین است یعنی مقدار بولین برمیگرداند 
   // مقدار واردشده در اینپوت موبایل را به آن میدهیم که در آرایه وجود داشتنش را بررسی کند و در نهایت ان را درون یک متغییر میرزیم که برای شرطمون ازش استفاده کنیم
   let isInclude = allContact.includes(contact);
   // و بعد شرط مینویسیم که اگر این متغییر وجود داشت یعنی آن شماره جزو لیست مخاطبین بود کاربر را به ان صفحه راهنمایی کند و در غیر این صورت خطا دهد
   if (isInclude) {
      window.open('http://127.0.0.1:5501/messenger/messenger.html')
   }
   if(!isInclude) {
      alert("شماره ای که وارد کرده اید جزو مخاطبین نیست")
   }
};

////////////////////////////////////////////* Edit contacs
// در اینجا یک تابع برای فرم ویرایش مخاطب نوشتیم که فقط میتواند نام ان را تغییر دهد
function editName() {
   // مقدار فیلد نام مخاطب را در یک متغیر ریختم
   let newContact  = document.getElementById('inputEditName').value;
   // در اینجا شرط گزاشتم که اگر طول رشته ی مقدار نام مخاطب از 3 حرف بیشتر بود پیام خطا نشان داده نشود و دکمه هم فعال شود
   if ( newContact.length >= 3 ) {
      document.getElementById('wrongEditName').innerHTML = "";
      document.getElementById('editButton').disabled = false;
   }else{
   //  ولی اگر طول رشته کمتر از 3 حرف بود دکمه فعال نمیشود و پیام خطا دریافت میکند
      document.getElementById('wrongEditName').innerHTML = "لطفا نام مخاطب را وارد کنید";
      document.getElementById('editButton').disabled = true;
   }
};
//  اینجاهم گفتم  زمانیکه کاربر دکمه ویرایش را کلیک کرد پیامی را دریافت کند
function editContactButton() {
   window.open('http://127.0.0.1:5501/messenger/messenger.html')
}

function addWinClose() {
   window.close('http://127.0.0.1:5501/add&editContact/addContact.html')
}
function EditWinClose() {
   window.close('http://127.0.0.1:5501/add&editContact/editContact.html')
}